{
    "_name_or_path": "/home/schandy/evaluation-pipeline/model_tokenizer/opt-350m-strict",
    "activation_dropout": 0.0,
    "activation_function": "relu",
    "architectures": [
      "SparseOPTForCausalLM"
    ],
    "attention_dropout": 0.0,
    "bos_token_id": 2,
    "do_layer_norm_before": false,
    "dropout": 0.1,
    "eos_token_id": 2,
    "ffn_dim": 4096,
    "dyad_dim": 4,
    "hidden_size": 1024,
    "init_std": 0.02,
    "layerdrop": 0.0,
    "max_position_embeddings": 2048,
    "model_type": "sparse_opt",
    "num_attention_heads": 16,
    "num_hidden_layers": 24,
    "pad_token_id": 1,
    "prefix": "</s>",
    "torch_dtype": "float32",
    "transformers_version": "4.20.0.dev0",
    "use_cache": true,
    "vocab_size": 50272,
    "lm_dyad_dim": 8,
    "word_embed_proj_dim": 512
}